read_liberty config/gscl45nm.lib
read_verilog out_apx/adder_4_0_approx1.v
link_design adder_4_0_approx1
create_clock -name clk -period 1
set_input_delay -clock clk 0 [all_inputs]
set_output_delay -clock clk 0 [all_outputs]
report_checks -digits 6
exit